# casks
tap 'homebrew/homebrew-cask' || true
cask_args appdir: '/Applications'

# utilities
cask 'google-chrome'
cask 'vlc'
cask 'xquartz'
cask 'kitty'

# dev
cask 'vscodium'
cask 'android-studio'
cask 'android-sdk'
cask 'google-cloud-sdk'

# wm
tap 'koekeishiya/formulae'
brew 'yabai'
brew 'koekeishiya/formulae/skhd'
tap 'homebrew/services'

# python
brew 'python'
brew 'flake8'
brew 'black'

# search
brew 'the_silver_searcher'

# applications
brew 'zim'

# gamedev
cask 'godot'
cask 'blender'
cask 'gimp'

